; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=96, out_folder=htg/blocksworld/training, instance_id=76, seed=2100, goal_proportion=0.1

(define (problem blocksworld-76)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 - object)
 (:init 
    (arm-empty)
    (clear b26)
    (on b26 b6)
    (on b6 b20)
    (on b20 b30)
    (on-table b30)
    (clear b69)
    (on b69 b68)
    (on-table b68)
    (clear b18)
    (on-table b18)
    (clear b65)
    (on b65 b84)
    (on-table b84)
    (clear b55)
    (on b55 b16)
    (on b16 b71)
    (on b71 b78)
    (on b78 b27)
    (on b27 b1)
    (on-table b1)
    (clear b3)
    (on-table b3)
    (clear b85)
    (on b85 b73)
    (on b73 b66)
    (on b66 b11)
    (on b11 b29)
    (on-table b29)
    (clear b91)
    (on-table b91)
    (clear b88)
    (on b88 b43)
    (on-table b43)
    (clear b19)
    (on-table b19)
    (clear b45)
    (on b45 b82)
    (on b82 b21)
    (on b21 b22)
    (on b22 b76)
    (on b76 b62)
    (on b62 b51)
    (on b51 b83)
    (on-table b83)
    (clear b40)
    (on b40 b79)
    (on b79 b8)
    (on b8 b58)
    (on-table b58)
    (clear b2)
    (on b2 b14)
    (on-table b14)
    (clear b77)
    (on b77 b75)
    (on b75 b89)
    (on b89 b36)
    (on-table b36)
    (clear b87)
    (on-table b87)
    (clear b46)
    (on b46 b24)
    (on b24 b86)
    (on-table b86)
    (clear b57)
    (on b57 b59)
    (on b59 b28)
    (on b28 b33)
    (on b33 b92)
    (on b92 b34)
    (on b34 b81)
    (on b81 b67)
    (on b67 b5)
    (on b5 b32)
    (on-table b32)
    (clear b17)
    (on b17 b23)
    (on b23 b90)
    (on b90 b31)
    (on b31 b74)
    (on b74 b42)
    (on b42 b93)
    (on b93 b37)
    (on-table b37)
    (clear b70)
    (on b70 b95)
    (on-table b95)
    (clear b63)
    (on-table b63)
    (clear b56)
    (on b56 b96)
    (on-table b96)
    (clear b35)
    (on b35 b64)
    (on b64 b44)
    (on b44 b10)
    (on-table b10)
    (clear b80)
    (on-table b80)
    (clear b41)
    (on b41 b54)
    (on b54 b49)
    (on-table b49)
    (clear b4)
    (on b4 b47)
    (on b47 b13)
    (on b13 b39)
    (on b39 b52)
    (on b52 b50)
    (on b50 b15)
    (on b15 b25)
    (on b25 b9)
    (on b9 b7)
    (on-table b7)
    (clear b48)
    (on b48 b53)
    (on b53 b72)
    (on-table b72)
    (clear b94)
    (on b94 b60)
    (on b60 b12)
    (on b12 b61)
    (on b61 b38)
    (on-table b38))
 (:goal  (and 
    (clear b5)
    (on-table b5)
    (clear b9)
    (on-table b9)
    (clear b3)
    (on b3 b6)
    (on b6 b7)
    (on b7 b4)
    (on-table b4)
    (clear b1)
    (on b1 b2)
    (on b2 b8)
    (on-table b8))))

; plan
1. (unstack b4 b47)
   deleted: (on b4 b47) (clear b4) (arm-empty)
   added: (holding b4) (clear b47)
   goals met: 1 of 13
2. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 13
3. (unstack b26 b6)
   deleted: (on b26 b6) (clear b26) (arm-empty)
   added: (holding b26) (clear b6)
   goals met: 2 of 13
4. (putdown b26)
   deleted: (holding b26)
   added: (clear b26) (arm-empty) (on-table b26)
   goals met: 2 of 13
5. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 1 of 13
6. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 3 of 13
7. (unstack b40 b79)
   deleted: (on b40 b79) (clear b40) (arm-empty)
   added: (holding b40) (clear b79)
   goals met: 3 of 13
8. (putdown b40)
   deleted: (holding b40)
   added: (clear b40) (arm-empty) (on-table b40)
   goals met: 3 of 13
9. (unstack b79 b8)
   deleted: (on b79 b8) (clear b79) (arm-empty)
   added: (holding b79) (clear b8)
   goals met: 3 of 13
10. (putdown b79)
   deleted: (holding b79)
   added: (clear b79) (arm-empty) (on-table b79)
   goals met: 3 of 13
11. (unstack b8 b58)
   deleted: (on b8 b58) (clear b8) (arm-empty)
   added: (holding b8) (clear b58)
   goals met: 3 of 13
12. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 13
13. (unstack b2 b14)
   deleted: (on b2 b14) (clear b2) (arm-empty)
   added: (holding b2) (clear b14)
   goals met: 4 of 13
14. (stack b2 b8)
   deleted: (clear b8) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b8)
   goals met: 5 of 13
15. (unstack b55 b16)
   deleted: (on b55 b16) (clear b55) (arm-empty)
   added: (holding b55) (clear b16)
   goals met: 5 of 13
16. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 13
17. (unstack b16 b71)
   deleted: (on b16 b71) (clear b16) (arm-empty)
   added: (holding b16) (clear b71)
   goals met: 5 of 13
18. (putdown b16)
   deleted: (holding b16)
   added: (clear b16) (arm-empty) (on-table b16)
   goals met: 5 of 13
19. (unstack b71 b78)
   deleted: (on b71 b78) (clear b71) (arm-empty)
   added: (holding b71) (clear b78)
   goals met: 5 of 13
20. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 5 of 13
21. (unstack b78 b27)
   deleted: (on b78 b27) (clear b78) (arm-empty)
   added: (holding b78) (clear b27)
   goals met: 5 of 13
22. (putdown b78)
   deleted: (holding b78)
   added: (clear b78) (arm-empty) (on-table b78)
   goals met: 5 of 13
23. (unstack b27 b1)
   deleted: (on b27 b1) (clear b27) (arm-empty)
   added: (holding b27) (clear b1)
   goals met: 6 of 13
24. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 6 of 13
25. (pickup b1)
   deleted: (clear b1) (on-table b1) (arm-empty)
   added: (holding b1)
   goals met: 5 of 13
26. (stack b1 b2)
   deleted: (clear b2) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b2)
   goals met: 7 of 13
27. (unstack b47 b13)
   deleted: (on b47 b13) (clear b47) (arm-empty)
   added: (holding b47) (clear b13)
   goals met: 7 of 13
28. (putdown b47)
   deleted: (holding b47)
   added: (clear b47) (arm-empty) (on-table b47)
   goals met: 7 of 13
29. (unstack b13 b39)
   deleted: (on b13 b39) (clear b13) (arm-empty)
   added: (holding b13) (clear b39)
   goals met: 7 of 13
30. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 7 of 13
31. (unstack b39 b52)
   deleted: (on b39 b52) (clear b39) (arm-empty)
   added: (holding b39) (clear b52)
   goals met: 7 of 13
32. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 7 of 13
33. (unstack b52 b50)
   deleted: (on b52 b50) (clear b52) (arm-empty)
   added: (holding b52) (clear b50)
   goals met: 7 of 13
34. (putdown b52)
   deleted: (holding b52)
   added: (clear b52) (arm-empty) (on-table b52)
   goals met: 7 of 13
35. (unstack b50 b15)
   deleted: (on b50 b15) (clear b50) (arm-empty)
   added: (holding b50) (clear b15)
   goals met: 7 of 13
36. (putdown b50)
   deleted: (holding b50)
   added: (clear b50) (arm-empty) (on-table b50)
   goals met: 7 of 13
37. (unstack b15 b25)
   deleted: (on b15 b25) (clear b15) (arm-empty)
   added: (holding b15) (clear b25)
   goals met: 7 of 13
38. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 7 of 13
39. (unstack b25 b9)
   deleted: (on b25 b9) (clear b25) (arm-empty)
   added: (holding b25) (clear b9)
   goals met: 8 of 13
40. (putdown b25)
   deleted: (holding b25)
   added: (clear b25) (arm-empty) (on-table b25)
   goals met: 8 of 13
41. (unstack b9 b7)
   deleted: (on b9 b7) (clear b9) (arm-empty)
   added: (holding b9) (clear b7)
   goals met: 7 of 13
42. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 9 of 13
43. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 9 of 13
44. (stack b7 b4)
   deleted: (clear b4) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b4)
   goals met: 10 of 13
45. (unstack b57 b59)
   deleted: (on b57 b59) (clear b57) (arm-empty)
   added: (holding b57) (clear b59)
   goals met: 10 of 13
46. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 10 of 13
47. (unstack b59 b28)
   deleted: (on b59 b28) (clear b59) (arm-empty)
   added: (holding b59) (clear b28)
   goals met: 10 of 13
48. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 10 of 13
49. (unstack b28 b33)
   deleted: (on b28 b33) (clear b28) (arm-empty)
   added: (holding b28) (clear b33)
   goals met: 10 of 13
50. (putdown b28)
   deleted: (holding b28)
   added: (clear b28) (arm-empty) (on-table b28)
   goals met: 10 of 13
51. (unstack b33 b92)
   deleted: (on b33 b92) (clear b33) (arm-empty)
   added: (holding b33) (clear b92)
   goals met: 10 of 13
52. (putdown b33)
   deleted: (holding b33)
   added: (clear b33) (arm-empty) (on-table b33)
   goals met: 10 of 13
53. (unstack b92 b34)
   deleted: (on b92 b34) (clear b92) (arm-empty)
   added: (holding b92) (clear b34)
   goals met: 10 of 13
54. (putdown b92)
   deleted: (holding b92)
   added: (clear b92) (arm-empty) (on-table b92)
   goals met: 10 of 13
55. (unstack b34 b81)
   deleted: (on b34 b81) (clear b34) (arm-empty)
   added: (holding b34) (clear b81)
   goals met: 10 of 13
56. (putdown b34)
   deleted: (holding b34)
   added: (clear b34) (arm-empty) (on-table b34)
   goals met: 10 of 13
57. (unstack b81 b67)
   deleted: (on b81 b67) (clear b81) (arm-empty)
   added: (holding b81) (clear b67)
   goals met: 10 of 13
58. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 10 of 13
59. (unstack b67 b5)
   deleted: (on b67 b5) (clear b67) (arm-empty)
   added: (holding b67) (clear b5)
   goals met: 11 of 13
60. (putdown b67)
   deleted: (holding b67)
   added: (clear b67) (arm-empty) (on-table b67)
   goals met: 11 of 13
61. (unstack b5 b32)
   deleted: (on b5 b32) (clear b5) (arm-empty)
   added: (holding b5) (clear b32)
   goals met: 10 of 13
62. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 12 of 13
63. (unstack b3 b6)
   deleted: (on b3 b6) (clear b3) (arm-empty)
   added: (holding b3) (clear b6)
   goals met: 10 of 13
64. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 11 of 13
65. (unstack b6 b20)
   deleted: (on b6 b20) (clear b6) (arm-empty)
   added: (holding b6) (clear b20)
   goals met: 11 of 13
66. (stack b6 b7)
   deleted: (clear b7) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b7)
   goals met: 12 of 13
67. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 11 of 13
68. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 13 of 13
